Autodesk.Revit.DB.Units.IsValidDecimalSymbolAndGrouping(Autodesk.Revit.DB.DecimalSymbol,Autodesk.Revit.DB.DigitGroupingSymbol,Autodesk.Revit.DB.DigitGroupingAmount)
Checks if a combination of decimal symbol and digit grouping settings is allowed.
Remarks:
All combinations are now permitted, so this method always returns
true.
decimalSymbol:
The decimal symbol.
digitGroupingSymbol:
The digit grouping symbol.
digitGroupingAmount:
The number of digits in each group.
Returns:
True if the combination is permitted.  Always returns true.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.Units.SetDecimalSymbolAndGrouping(Autodesk.Revit.DB.DecimalSymbol,Autodesk.Revit.DB.DigitGroupingSymbol,Autodesk.Revit.DB.DigitGroupingAmount)
Sets the decimal symbol and digit grouping.
Remarks:
This method is equivalent to setting the
DecimalSymbol,
DigitGroupingSymbol, and
DigitGroupingAmount
properties.  For details, see the documentation for those
properties.
decimalSymbol:
The decimal symbol.
digitGroupingSymbol:
The digit grouping symbol.
digitGroupingAmount:
The number of digits in each group.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.Units.GetDisplayUnitType
Gets the display unit for the UT_Length unit type.
Remarks:
This method is equivalent to
GetFormatOptions(UnitType.UT_Length).DisplayUnits.
Returns:
The length display unit.
Since:
2014

Autodesk.Revit.DB.Units.SetFormatOptions(Autodesk.Revit.DB.UnitType,Autodesk.Revit.DB.FormatOptions)
Sets the default FormatOptions for a unit type.
Remarks:
Some unit types have definitions which are automatically derived
from other unit types.  For example, UT_SheetLength is derived from
UT_Length and UT_ForceScale is derived from UT_Force.  In such
cases, calling SetFormatOptions() for one unit type may have the
side effect of changing the FormatOptions for other unit types that
depend on it.
unitType:
The unit type.
options:
The ForrmatOptions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitType is an invalid unit type.  See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes().
-or-
FormatOptions cannot be modified for unitType.  See Units.IsModifiableUnitType() and Units.GetModifiableUnitTypes().
-or-
UseDefault is true in options.
-or-
The display unit in options is not a valid display unit for unitType.  See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType) and UnitUtils.GetValidDisplayUnits(UnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014